Revit 2027 API
RebarShapeDefinitionBySegments.SetSegmentAs180DegreeBend(Int32) Method
 Indicates that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be taken from the Bar Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSegmentAs180DegreeBend(
	int iSegment
)
Public Sub SetSegmentAs180DegreeBend (
	iSegment As Integer
)
public:
void SetSegmentAs180DegreeBend(
	int iSegment
)
member SetSegmentAs180DegreeBend :
        iSegment : int -> unit
Parameters
iSegment Int32
 Index of the segment (0 to NumberOfSegments - 1).
Exceptions
Exception | Condition
ArgumentException |  iSegment is not between 0 and NumberOfSegments.
See Also
Reference
RebarShapeDefinitionBySegments Class
SetSegmentAs180DegreeBend Overload
Autodesk.Revit.DB.Structure Namespace